bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA325PA.xml
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                </register>
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1"
                          ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="USART" name="USART">
            <register-group caption="USART" name="USART0">
                <register caption="USART I/O Data Register" name="UDR0" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR0A" offset="0xC0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
                    <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE0"/>
                    <bitfield caption="Data OverRun" mask="0x08" name="DOR0"/>
                    <bitfield caption="USART Parity Error" mask="0x04" name="UPE0"/>
                    <bitfield caption="Double the USART Transmission Speed" mask="0x02" name="U2X0"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
                    <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
                    <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL0" values="COMM_USART_MODE"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ0"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
                </register>
                <register caption="USART Baud Rate Register  Bytes" name="UBRR0" offset="0xC4" size="2" mask="0x0FFF"/>
            </register-group>
            <value-group caption="" name="COMM_USART_MODE">
                <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
